rsp_week09.org
#+title: /Rsp_week09/

* environment configuration
**alias/command to help with environment varialbe being too long**
#+begin_src shell
echo $RTT_COMPONENT_PATH
# change the colcon prefix
export COLCON_PREFIX_PATH=/home/huan/test_ws/install

#+end_src
copied/pasted in your =.bashrc= file below. After that you can set the variable by typing ="rsp_rtt"=
#+begin_src shell
alias rsp_rtt='export RTT_COMPONENT_PATH=$COLCON_PREFIX_PATH/kdl_typekit/lib/orocos:$COLCON_PREFIX_PATH/orocos_toolchain/lib/orocos:$COLCON_PREFIX_PATH/rtt_ros2_builtin_interfaces/lib/orocos:$COLCON_PREFIX_PATH/rtt_ros2_geometry_msgs/lib/orocos:$COLCON_PREFIX_PATH/rtt_ros2_interfaces/lib/orocos:$COLCON_PREFIX_PATH/rtt_ros2/lib/orocos:$COLCON_PREFIX_PATH/rtt_ros2_node/lib/orocos:$COLCON_PREFIX_PATH/rtt_ros2_params/lib/orocos:$COLCON_PREFIX_PATH/rtt_ros2_primitives_typekit/lib/orocos:$COLCON_PREFIX_PATH/rtt_ros2_rclcpp_typekit/lib/orocos:$COLCON_PREFIX_PATH/rtt_ros2_std_msgs/lib/orocos:$COLCON_PREFIX_PATH/rtt_ros2_topics/lib/orocos:$COLCON_PREFIX_PATH/rsp_week07/lib/orocos'

#+end_src

#+RESULTS:

** update =robot.hpp=
#+begin_src c++
#include <ReflexxesAPI.h>
#include <RMLPositionFlags.h>
#include <RMLPositionInputParameters.h>
#include <RMLPositionOutputParameters.h>

#include <rtt/TaskContext.hpp>
#include <rtt/InputPort.hpp>
#include <rtt/OutputPort.hpp>

#include <kdl/chainfksolverpos_recursive.hpp>
#include <kdl_parser/kdl_parser.hpp>
#include <kdl/frames.hpp>

#include <rtt_ros2_params/rtt_ros2_params.hpp>

#include <geometry_msgs/msg/pose_stamped.hpp>

#include <kdl/frames.hpp>
#include <kdl/jntarray.hpp>

class rtt_robot : public RTT::TaskContext {

private:

  RTT::InputPort<KDL::Wrench> port_msr_wrench;
  RTT::OutputPort<KDL::JntArray> port_msr_joints;
  RTT::OutputPort<geometry_msgs::msg::PoseStamped> port_msr_pose;

  RTT::OperationCaller<void(void)> zero;
  RTT::OperationCaller<void(const KDL::Wrench&)> offset;

  //size_t N;
  ReflexxesAPI* rml;
  RMLPositionInputParameters* ip;
  RMLPositionOutputParameters* op;
  RMLPositionFlags flags;

  RTT::Service::shared_ptr global_ros;
  RTT::Service::shared_ptr global_params;
  RTT::OperationCaller<rclcpp::ParameterValue(std::string)> getparam_operation;

  KDL::Chain chain;
  KDL::ChainFkSolverPos_recursive* fk_solver;

public:

  rtt_robot( const std::string& name );
  ~rtt_robot();

  virtual bool configureHook();
  virtual bool startHook();

  virtual void updateHook();

  virtual void stopHook();
  virtual void cleanupHook();

};
#+end_src
