rsp_week09.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-04-09 Sun 19:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>/Rsp_week09/</title>
<meta name="author" content="Huan Min" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title"><i>Rsp<sub>week09</sub></i></h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga0177da">1. environment configuration</a>
<ul>
<li><a href="#orgea8906e">1.1. update <code>robot.hpp</code></a></li>
<li><a href="#org7988c6f">1.2. update <code>robot.cpp</code></a></li>
<li><a href="#org3d3545d">1.3. update <code>rtt_robot.ops</code></a></li>
<li><a href="#orge639f73">1.4. Reflexxes api</a></li>
<li><a href="#orgf0f6df7">1.5. Create an Ros node</a></li>
<li><a href="#org24fc4a6">1.6. Create an ROS Param</a></li>
<li><a href="#orga624cb9">1.7. Plugin the urdf into Orocos</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orga0177da" class="outline-2">
<h2 id="orga0177da"><span class="section-number-2">1.</span> environment configuration</h2>
<div class="outline-text-2" id="text-1">
<p>
<b><b>alias/command to help with environment varialbe being too long</b></b>
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #ECBE7B;">echo</span> $<span style="color: #dcaeea;">RTT_COMPONENT_PATH</span>
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">change the colcon prefix</span>
<span style="color: #c678dd;">export</span> <span style="color: #dcaeea;">COLCON_PREFIX_PATH</span>=/home/huan/test_ws/install

</pre>
</div>
<p>
copied/pasted in your <code>.bashrc</code> file below. After that you can set the variable by typing <code>"rsp_rtt"</code>
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #c678dd;">alias</span> <span style="color: #dcaeea;">rsp_rtt</span>=<span style="color: #98be65;">'export RTT_COMPONENT_PATH=$COLCON_PREFIX_PATH/kdl_typekit/lib/orocos:$COLCON_PREFIX_PATH/orocos_toolchain/lib/orocos:$COLCON_PREFIX_PATH/rtt_ros2_builtin_interfaces/lib/orocos:$COLCON_PREFIX_PATH/rtt_ros2_geometry_msgs/lib/orocos:$COLCON_PREFIX_PATH/rtt_ros2_interfaces/lib/orocos:$COLCON_PREFIX_PATH/rtt_ros2/lib/orocos:$COLCON_PREFIX_PATH/rtt_ros2_node/lib/orocos:$COLCON_PREFIX_PATH/rtt_ros2_params/lib/orocos:$COLCON_PREFIX_PATH/rtt_ros2_primitives_typekit/lib/orocos:$COLCON_PREFIX_PATH/rtt_ros2_rclcpp_typekit/lib/orocos:$COLCON_PREFIX_PATH/rtt_ros2_std_msgs/lib/orocos:$COLCON_PREFIX_PATH/rtt_ros2_topics/lib/orocos:$COLCON_PREFIX_PATH/rsp_week07/lib/orocos'</span>

</pre>
</div>
</div>

<div id="outline-container-orgea8906e" class="outline-3">
<h3 id="orgea8906e"><span class="section-number-3">1.1.</span> update <code>robot.hpp</code></h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #51afef; font-weight: bold;">#include</span> <span style="color: #98be65;">&lt;ReflexxesAPI.h&gt;</span>
<span style="color: #51afef; font-weight: bold;">#include</span> <span style="color: #98be65;">&lt;RMLPositionFlags.h&gt;</span>
<span style="color: #51afef; font-weight: bold;">#include</span> <span style="color: #98be65;">&lt;RMLPositionInputParameters.h&gt;</span>
<span style="color: #51afef; font-weight: bold;">#include</span> <span style="color: #98be65;">&lt;RMLPositionOutputParameters.h&gt;</span>

<span style="color: #51afef; font-weight: bold;">#include</span> <span style="color: #98be65;">&lt;rtt/TaskContext.hpp&gt;</span>
<span style="color: #51afef; font-weight: bold;">#include</span> <span style="color: #98be65;">&lt;rtt/InputPort.hpp&gt;</span>
<span style="color: #51afef; font-weight: bold;">#include</span> <span style="color: #98be65;">&lt;rtt/OutputPort.hpp&gt;</span>

<span style="color: #51afef; font-weight: bold;">#include</span> <span style="color: #98be65;">&lt;kdl/chainfksolverpos_recursive.hpp&gt;</span>
<span style="color: #51afef; font-weight: bold;">#include</span> <span style="color: #98be65;">&lt;kdl_parser/kdl_parser.hpp&gt;</span>
<span style="color: #51afef; font-weight: bold;">#include</span> <span style="color: #98be65;">&lt;kdl/frames.hpp&gt;</span>

<span style="color: #51afef; font-weight: bold;">#include</span> <span style="color: #98be65;">&lt;rtt_ros2_params/rtt_ros2_params.hpp&gt;</span>

<span style="color: #51afef; font-weight: bold;">#include</span> <span style="color: #98be65;">&lt;geometry_msgs/msg/pose_stamped.hpp&gt;</span>

<span style="color: #51afef; font-weight: bold;">#include</span> <span style="color: #98be65;">&lt;kdl/frames.hpp&gt;</span>
<span style="color: #51afef; font-weight: bold;">#include</span> <span style="color: #98be65;">&lt;kdl/jntarray.hpp&gt;</span>

<span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">rtt_robot</span> : <span style="color: #51afef;">public</span> <span style="color: #a9a1e1;">RTT</span>::<span style="color: #ECBE7B;">TaskContext</span> {

<span style="color: #51afef;">private</span>:

  <span style="color: #a9a1e1;">RTT</span>::<span style="color: #ECBE7B;">InputPort</span>&lt;<span style="color: #a9a1e1;">KDL</span>::Wrench&gt; <span style="color: #dcaeea;">port_msr_wrench</span>;
  <span style="color: #a9a1e1;">RTT</span>::<span style="color: #ECBE7B;">OutputPort</span>&lt;<span style="color: #a9a1e1;">KDL</span>::JntArray&gt; <span style="color: #dcaeea;">port_msr_joints</span>;
  <span style="color: #a9a1e1;">RTT</span>::<span style="color: #ECBE7B;">OutputPort</span>&lt;<span style="color: #a9a1e1;">geometry_msgs</span>::<span style="color: #a9a1e1;">msg</span>::PoseStamped&gt; <span style="color: #dcaeea;">port_msr_pose</span>;

  <span style="color: #a9a1e1;">RTT</span>::<span style="color: #ECBE7B;">OperationCaller</span>&lt;<span style="color: #ECBE7B;">void</span>(<span style="color: #ECBE7B;">void</span>)&gt; <span style="color: #dcaeea;">zero</span>;
  <span style="color: #a9a1e1;">RTT</span>::<span style="color: #ECBE7B;">OperationCaller</span>&lt;<span style="color: #ECBE7B;">void</span>(<span style="color: #51afef;">const</span> <span style="color: #a9a1e1;">KDL</span>::<span style="color: #ECBE7B;">Wrench</span>&amp;)&gt; <span style="color: #dcaeea;">offset</span>;

  <span style="color: #5B6268;">//</span><span style="color: #5B6268;">size_t N;</span>
  <span style="color: #ECBE7B;">ReflexxesAPI</span>* <span style="color: #dcaeea;">rml</span>;
  <span style="color: #ECBE7B;">RMLPositionInputParameters</span>* <span style="color: #dcaeea;">ip</span>;
  <span style="color: #ECBE7B;">RMLPositionOutputParameters</span>* <span style="color: #dcaeea;">op</span>;
  <span style="color: #ECBE7B;">RMLPositionFlags</span> <span style="color: #dcaeea;">flags</span>;

  <span style="color: #a9a1e1;">RTT</span>::<span style="color: #a9a1e1;">Service</span>::<span style="color: #ECBE7B;">shared_ptr</span> <span style="color: #dcaeea;">global_ros</span>;
  <span style="color: #a9a1e1;">RTT</span>::<span style="color: #a9a1e1;">Service</span>::<span style="color: #ECBE7B;">shared_ptr</span> <span style="color: #dcaeea;">global_params</span>;
  <span style="color: #a9a1e1;">RTT</span>::<span style="color: #ECBE7B;">OperationCaller</span>&lt;<span style="color: #a9a1e1;">rclcpp</span>::ParameterValue(<span style="color: #a9a1e1;">std</span>::string)&gt; <span style="color: #dcaeea;">getparam_operation</span>;

  <span style="color: #a9a1e1;">KDL</span>::<span style="color: #ECBE7B;">Chain</span> <span style="color: #dcaeea;">chain</span>;
  <span style="color: #a9a1e1;">KDL</span>::<span style="color: #ECBE7B;">ChainFkSolverPos_recursive</span>* <span style="color: #dcaeea;">fk_solver</span>;

<span style="color: #51afef;">public</span>:

  <span style="color: #c678dd;">rtt_robot</span>( <span style="color: #51afef;">const</span> <span style="color: #a9a1e1;">std</span>::<span style="color: #ECBE7B;">string</span>&amp; <span style="color: #dcaeea;">name</span> );
  ~<span style="color: #c678dd;">rtt_robot</span>();

  <span style="color: #51afef;">virtual</span> <span style="color: #ECBE7B;">bool</span> <span style="color: #c678dd;">configureHook</span>();
  <span style="color: #51afef;">virtual</span> <span style="color: #ECBE7B;">bool</span> <span style="color: #c678dd;">startHook</span>();

  <span style="color: #51afef;">virtual</span> <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">updateHook</span>();

  <span style="color: #51afef;">virtual</span> <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">stopHook</span>();
  <span style="color: #51afef;">virtual</span> <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">cleanupHook</span>();

};
</pre>
</div>
</div>
</div>
