rsp_week09.org
** update =robot.cpp=
#+begin_src c++
#include <rsp_week07/rtt_robot.hpp>
#include <iomanip>

#include <rtt/internal/GlobalService.hpp>

#include <rtt_ros2/rtt_ros2.hpp>
#include <rtt_ros2_node/rtt_ros2_node.hpp>
#include <rtt_ros2_params/rtt_ros2_params.hpp>

#include <tf2_kdl/tf2_kdl.h>


#include <rtt/Component.hpp>

rtt_robot::rtt_robot( const std::string& name ) :
  TaskContext(name),
  //foward kinematics solver
  fk_solver(NULL){

  std::cout << "rtt_robot::rtt_robot" << std::endl;
  // Data flow ports
  addPort("MsrWrench", port_msr_wrench ).doc("Measured wrench");
  addPort("MsrJntPos", port_msr_joints ).doc("Measured joint positions");
  addPort("MsrCartPose", port_msr_pose ).doc("Measured Cartesian position");

  global_ros = RTT::internal::GlobalService::Instance()->getService("ros");
  RTT::OperationCaller<bool(const std::string&)> create_node =
    global_ros->getOperation("create_named_node");
  create_node.ready();
  create_node(name);

  global_params = global_ros->getService("rosparam");
  getparam_operation = global_params->getOperation("getParameter");

  rtt_ros2_node::getNode(this)->declare_parameter("robot_description",
                                                  std::string("asdf"));

}

rtt_robot::~rtt_robot(){
  if(rml) delete rml;
  if (ip) delete ip;
  if (op) delete op;
  if (fk_solver) delete fk_solver;
}

bool rtt_robot::configureHook(){

  std::cout << "rtt_robot::configureHook" << std::endl;

  std::vector<std::string> peer_list = getPeerList();
  for(size_t i=0; i<peer_list.size(); i++ ){
    std::cout << "Peer " << i << " " << peer_list[i] << std::endl;
    if( peer_list[i] == "sensor" ){
      zero = getPeer(peer_list[i])->getOperation("Zero");
      offset = getPeer(peer_list[i])->getOperation("SetOffset");
    }
  }

  rclcpp::ParameterValue new_string = getparam_operation.call("robot_description");

  std::string robot_description = new_string.get<std::string>();

  RTT::log().setLogLevel( RTT::Logger::Info );

  KDL::Tree tree;
  if( kdl_parser::treeFromString( robot_description, tree)){
    RTT::log(RTT::Info) << "Description parsed to a tree" << RTT::endlog();
    if( tree.getChain("world", "left_tool", chain)){
      fk_solver = new KDL::ChainFkSolverPos_recursive(chain);
    }
    else{
      RTT::log(RTT::Error) << "Failed to parse chain between world and link"
                           << RTT::endlog();
    }
  }
  else{
    RTT::log(RTT::Error) << "Failed to parse tree" << RTT::endlog();
  }
  RTT::log(RTT::Info) << "Description parsed to a chain" << RTT::endlog();

  rml = new ReflexxesAPI( chain.getNrOfJoints(), getPeriod() );
  ip = new RMLPositionInputParameters( chain.getNrOfJoints() );
  op = new RMLPositionOutputParameters( chain.getNrOfJoints() );

  return true;
}

bool rtt_robot::startHook(){
  std::cout << "rtt_robot::startHook" << std::endl;

  for( size_t i=0; i<chain.getNrOfJoints(); i++ ){

    // current state of the robot
    // In reality you need to querry the real robot to get these
    ip->CurrentPositionVector->VecData[i] = 0.0;
    ip->CurrentVelocityVector->VecData[i] = 0.0;
    ip->CurrentAccelerationVector->VecData[i] = 0.0;

    // robot limits
    // These should come from a config file
    ip->MaxVelocityVector->VecData[i] = 1.0;
    ip->MaxAccelerationVector->VecData[i] = 1.0;
    ip->MaxJerkVector->VecData[i] = 10.0;

    ip->SelectionVector->VecData[i] = true;

  }

  // These are goal position/velocities
  // This has no business here and should come from an operation/port
  ip->TargetPositionVector->VecData[0] = 1.0;
  ip->TargetPositionVector->VecData[1] = 3.0;
  ip->TargetVelocityVector->VecData[0] = 0.0;
  ip->TargetVelocityVector->VecData[1] = 0.0;

  return true;
}

void rtt_robot::updateHook(){

  KDL::Wrench ft;
  if( port_msr_wrench.read( ft ) == RTT::NewData ){
    /*
      std::cout << std::endl
      << "rtt_robot::updateHook: "
      << ft.force.x() << std::setw(15)
      << ft.force.y() << std::setw(15)
      << ft.force.z() << std::endl;
    ,*/
  }

  // mess with the FT sensor
  zero.send();
  offset.send( ft );

  // Interpolate the next trajectory point
  int result = rml->RMLPosition( *ip, op, flags );

  // Update the current state to be the state
  // This assume that the positions/velocities/accelerations
  // are sent to the real robot _and_ that the real robot
  // will move to that position. Otherwise, the current state
  // should be obtained from the real roboto
  ,*ip->CurrentPositionVector = *op->NewPositionVector;
  ,*ip->CurrentVelocityVector = *op->NewVelocityVector;
  ,*ip->CurrentAccelerationVector = *op->NewAccelerationVector;

  // Pack the position into KDL and write to port
  KDL::JntArray q(chain.getNrOfJoints()), qd(chain.getNrOfJoints());
  // [[http://docs.ros.org/en/indigo/api/orocos_kdl/html/classKDL_1_1JntArray.html][jntarray api]]
  op->GetNewPositionVector( q.data.data(), sizeof(double)*chain.getNrOfJoints() );
  op->GetNewVelocityVector( qd.data.data(), sizeof(double)*chain.getNrOfJoints() );

  if (result ==0){
    for (int i=0;i<N;i++){
      std::cout<<std::setw(15)<<q(i)<<std::setw(15)<<qd(i);
    }
    std::endl;
  }
  port_msr_joints.write(q);

  if( fk_solver != NULL ){

    KDL::Frame Rt;
    //[[http://docs.ros.org/en/indigo/api/orocos_kdl/html/classKDL_1_1ChainFkSolverPos.html][KDL::JntToCart]]
    int result = fk_solver->JntToCart(q, Rt);
    if( result < 0 ){
      RTT::log(RTT::Error) << "Failed to compute FK" << RTT::endlog();
    }
    else{
      geometry_msgs::msg::PoseStamped pose;
      pose.header.frame_id = "world";
      pose.pose = tf2::toMsg( Rt );
      port_msr_pose.write(pose);
    }
  }

}

void rtt_robot::stopHook(){
  std::cout << "rtt_robot::stopHook" << std::endl;
}

void rtt_robot::cleanupHook(){
  std::cout << "rtt_robot::cleanupHook" << std::endl;
}

ORO_CREATE_COMPONENT(rtt_robot)

#+end_src

