rsp_week09.html
<div id="outline-container-org7988c6f" class="outline-3">
<h3 id="org7988c6f"><span class="section-number-3">1.2.</span> update <code>robot.cpp</code></h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #51afef; font-weight: bold;">#include</span> <span style="color: #98be65;">&lt;rsp_week07/rtt_robot.hpp&gt;</span>
<span style="color: #51afef; font-weight: bold;">#include</span> <span style="color: #98be65;">&lt;iomanip&gt;</span>

<span style="color: #51afef; font-weight: bold;">#include</span> <span style="color: #98be65;">&lt;rtt/internal/GlobalService.hpp&gt;</span>

<span style="color: #51afef; font-weight: bold;">#include</span> <span style="color: #98be65;">&lt;rtt_ros2/rtt_ros2.hpp&gt;</span>
<span style="color: #51afef; font-weight: bold;">#include</span> <span style="color: #98be65;">&lt;rtt_ros2_node/rtt_ros2_node.hpp&gt;</span>
<span style="color: #51afef; font-weight: bold;">#include</span> <span style="color: #98be65;">&lt;rtt_ros2_params/rtt_ros2_params.hpp&gt;</span>

<span style="color: #51afef; font-weight: bold;">#include</span> <span style="color: #98be65;">&lt;tf2_kdl/tf2_kdl.h&gt;</span>


<span style="color: #51afef; font-weight: bold;">#include</span> <span style="color: #98be65;">&lt;rtt/Component.hpp&gt;</span>

<span style="color: #a9a1e1;">rtt_robot</span>::<span style="color: #c678dd;">rtt_robot</span>( <span style="color: #51afef;">const</span> <span style="color: #a9a1e1;">std</span>::<span style="color: #ECBE7B;">string</span>&amp; <span style="color: #dcaeea;">name</span> ) :
  TaskContext(name),
  <span style="color: #5B6268;">//</span><span style="color: #5B6268;">foward kinematics solver</span>
  fk_solver(<span style="color: #a9a1e1;">NULL</span>){

  <span style="color: #a9a1e1;">std</span>::cout &lt;&lt; <span style="color: #98be65;">"rtt_robot::rtt_robot"</span> &lt;&lt; <span style="color: #a9a1e1;">std</span>::endl;
  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">Data flow ports</span>
  addPort(<span style="color: #98be65;">"MsrWrench"</span>, port_msr_wrench ).doc(<span style="color: #98be65;">"Measured wrench"</span>);
  addPort(<span style="color: #98be65;">"MsrJntPos"</span>, port_msr_joints ).doc(<span style="color: #98be65;">"Measured joint positions"</span>);
  addPort(<span style="color: #98be65;">"MsrCartPose"</span>, port_msr_pose ).doc(<span style="color: #98be65;">"Measured Cartesian position"</span>);

  global_ros = <span style="color: #a9a1e1;">RTT</span>::<span style="color: #a9a1e1;">internal</span>::<span style="color: #a9a1e1;">GlobalService</span>::Instance()-&gt;getService(<span style="color: #98be65;">"ros"</span>);
  <span style="color: #a9a1e1;">RTT</span>::<span style="color: #ECBE7B;">OperationCaller</span>&lt;<span style="color: #ECBE7B;">bool</span>(<span style="color: #51afef;">const</span> <span style="color: #a9a1e1;">std</span>::<span style="color: #ECBE7B;">string</span>&amp;)&gt; <span style="color: #dcaeea;">create_node</span> =
    global_ros-&gt;getOperation(<span style="color: #98be65;">"create_named_node"</span>);
  create_node.ready();
  create_node(name);

  global_params = global_ros-&gt;getService(<span style="color: #98be65;">"rosparam"</span>);
  getparam_operation = global_params-&gt;getOperation(<span style="color: #98be65;">"getParameter"</span>);

  <span style="color: #a9a1e1;">rtt_ros2_node</span>::getNode(<span style="color: #51afef;">this</span>)-&gt;declare_parameter(<span style="color: #98be65;">"robot_description"</span>,
                                                  <span style="color: #a9a1e1;">std</span>::string(<span style="color: #98be65;">"asdf"</span>));

}

<span style="color: #a9a1e1;">rtt_robot</span>::~<span style="color: #c678dd;">rtt_robot</span>(){
  <span style="color: #51afef;">if</span>(rml) <span style="color: #51afef;">delete</span> rml;
  <span style="color: #51afef;">if</span> (ip) <span style="color: #51afef;">delete</span> ip;
  <span style="color: #51afef;">if</span> (op) <span style="color: #51afef;">delete</span> op;
  <span style="color: #51afef;">if</span> (fk_solver) <span style="color: #51afef;">delete</span> fk_solver;
}

<span style="color: #ECBE7B;">bool</span> <span style="color: #a9a1e1;">rtt_robot</span>::<span style="color: #c678dd;">configureHook</span>(){

  <span style="color: #a9a1e1;">std</span>::cout &lt;&lt; <span style="color: #98be65;">"rtt_robot::configureHook"</span> &lt;&lt; <span style="color: #a9a1e1;">std</span>::endl;

  <span style="color: #a9a1e1;">std</span>::<span style="color: #ECBE7B;">vector</span>&lt;<span style="color: #a9a1e1;">std</span>::<span style="color: #ECBE7B;">string</span>&gt; <span style="color: #dcaeea;">peer_list</span> = getPeerList();
  <span style="color: #51afef;">for</span>(<span style="color: #ECBE7B;">size_t</span> <span style="color: #dcaeea;">i</span>=<span style="color: #da8548; font-weight: bold;">0</span>; i&lt;peer_list.size(); i++ ){
    <span style="color: #a9a1e1;">std</span>::cout &lt;&lt; <span style="color: #98be65;">"Peer "</span> &lt;&lt; i &lt;&lt; <span style="color: #98be65;">" "</span> &lt;&lt; peer_list[i] &lt;&lt; <span style="color: #a9a1e1;">std</span>::endl;
    <span style="color: #51afef;">if</span>( peer_list[i] == <span style="color: #98be65;">"sensor"</span> ){
      zero = getPeer(peer_list[i])-&gt;getOperation(<span style="color: #98be65;">"Zero"</span>);
      offset = getPeer(peer_list[i])-&gt;getOperation(<span style="color: #98be65;">"SetOffset"</span>);
    }
  }

  <span style="color: #a9a1e1;">rclcpp</span>::<span style="color: #ECBE7B;">ParameterValue</span> <span style="color: #dcaeea;">new_string</span> = getparam_operation.call(<span style="color: #98be65;">"robot_description"</span>);

  <span style="color: #a9a1e1;">std</span>::<span style="color: #ECBE7B;">string</span> <span style="color: #dcaeea;">robot_description</span> = new_string.get&lt;<span style="color: #a9a1e1;">std</span>::<span style="color: #ECBE7B;">string</span>&gt;();

  <span style="color: #a9a1e1;">RTT</span>::log().setLogLevel( <span style="color: #a9a1e1;">RTT</span>::<span style="color: #a9a1e1;">Logger</span>::Info );

  <span style="color: #a9a1e1;">KDL</span>::<span style="color: #ECBE7B;">Tree</span> <span style="color: #dcaeea;">tree</span>;
  <span style="color: #51afef;">if</span>( <span style="color: #a9a1e1;">kdl_parser</span>::treeFromString( robot_description, tree)){
    <span style="color: #a9a1e1;">RTT</span>::log(<span style="color: #a9a1e1;">RTT</span>::Info) &lt;&lt; <span style="color: #98be65;">"Description parsed to a tree"</span> &lt;&lt; <span style="color: #a9a1e1;">RTT</span>::endlog();
    <span style="color: #51afef;">if</span>( tree.getChain(<span style="color: #98be65;">"world"</span>, <span style="color: #98be65;">"left_tool"</span>, chain)){
      fk_solver = <span style="color: #51afef;">new</span> <span style="color: #a9a1e1;">KDL</span>::<span style="color: #ECBE7B;">ChainFkSolverPos_recursive</span>(chain);
    }
    <span style="color: #51afef;">else</span>{
      <span style="color: #a9a1e1;">RTT</span>::log(<span style="color: #a9a1e1;">RTT</span>::Error) &lt;&lt; <span style="color: #98be65;">"Failed to parse chain between world and link"</span>
                           &lt;&lt; <span style="color: #a9a1e1;">RTT</span>::endlog();
    }
  }
  <span style="color: #51afef;">else</span>{
    <span style="color: #a9a1e1;">RTT</span>::log(<span style="color: #a9a1e1;">RTT</span>::Error) &lt;&lt; <span style="color: #98be65;">"Failed to parse tree"</span> &lt;&lt; <span style="color: #a9a1e1;">RTT</span>::endlog();
  }
  <span style="color: #a9a1e1;">RTT</span>::log(<span style="color: #a9a1e1;">RTT</span>::Info) &lt;&lt; <span style="color: #98be65;">"Description parsed to a chain"</span> &lt;&lt; <span style="color: #a9a1e1;">RTT</span>::endlog();

  rml = <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">ReflexxesAPI</span>( chain.getNrOfJoints(), getPeriod() );
  ip = <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">RMLPositionInputParameters</span>( chain.getNrOfJoints() );
  op = <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">RMLPositionOutputParameters</span>( chain.getNrOfJoints() );

  <span style="color: #51afef;">return</span> <span style="color: #a9a1e1;">true</span>;
}

<span style="color: #ECBE7B;">bool</span> <span style="color: #a9a1e1;">rtt_robot</span>::<span style="color: #c678dd;">startHook</span>(){
  <span style="color: #a9a1e1;">std</span>::cout &lt;&lt; <span style="color: #98be65;">"rtt_robot::startHook"</span> &lt;&lt; <span style="color: #a9a1e1;">std</span>::endl;

  <span style="color: #51afef;">for</span>( <span style="color: #ECBE7B;">size_t</span> <span style="color: #dcaeea;">i</span>=<span style="color: #da8548; font-weight: bold;">0</span>; i&lt;chain.getNrOfJoints(); i++ ){

    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">current state of the robot</span>
    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">In reality you need to querry the real robot to get these</span>
    ip-&gt;CurrentPositionVector-&gt;VecData[i] = <span style="color: #da8548; font-weight: bold;">0.0</span>;
    ip-&gt;CurrentVelocityVector-&gt;VecData[i] = <span style="color: #da8548; font-weight: bold;">0.0</span>;
    ip-&gt;CurrentAccelerationVector-&gt;VecData[i] = <span style="color: #da8548; font-weight: bold;">0.0</span>;

    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">robot limits</span>
    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">These should come from a config file</span>
    ip-&gt;MaxVelocityVector-&gt;VecData[i] = <span style="color: #da8548; font-weight: bold;">1.0</span>;
    ip-&gt;MaxAccelerationVector-&gt;VecData[i] = <span style="color: #da8548; font-weight: bold;">1.0</span>;
    ip-&gt;MaxJerkVector-&gt;VecData[i] = <span style="color: #da8548; font-weight: bold;">10.0</span>;

    ip-&gt;SelectionVector-&gt;VecData[i] = <span style="color: #a9a1e1;">true</span>;

  }

  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">These are goal position/velocities</span>
  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">This has no business here and should come from an operation/port</span>
  ip-&gt;TargetPositionVector-&gt;VecData[<span style="color: #da8548; font-weight: bold;">0</span>] = <span style="color: #da8548; font-weight: bold;">1.0</span>;
  ip-&gt;TargetPositionVector-&gt;VecData[<span style="color: #da8548; font-weight: bold;">1</span>] = <span style="color: #da8548; font-weight: bold;">3.0</span>;
  ip-&gt;TargetVelocityVector-&gt;VecData[<span style="color: #da8548; font-weight: bold;">0</span>] = <span style="color: #da8548; font-weight: bold;">0.0</span>;
  ip-&gt;TargetVelocityVector-&gt;VecData[<span style="color: #da8548; font-weight: bold;">1</span>] = <span style="color: #da8548; font-weight: bold;">0.0</span>;

  <span style="color: #51afef;">return</span> <span style="color: #a9a1e1;">true</span>;
}

<span style="color: #ECBE7B;">void</span> <span style="color: #a9a1e1;">rtt_robot</span>::<span style="color: #c678dd;">updateHook</span>(){

  <span style="color: #a9a1e1;">KDL</span>::<span style="color: #ECBE7B;">Wrench</span> <span style="color: #dcaeea;">ft</span>;
  <span style="color: #51afef;">if</span>( port_msr_wrench.read( ft ) == <span style="color: #a9a1e1;">RTT</span>::NewData ){
    <span style="color: #5B6268;">/*</span>
<span style="color: #5B6268;">      std::cout &lt;&lt; std::endl</span>
<span style="color: #5B6268;">      &lt;&lt; "rtt_robot::updateHook: "</span>
<span style="color: #5B6268;">      &lt;&lt; ft.force.x() &lt;&lt; std::setw(15)</span>
<span style="color: #5B6268;">      &lt;&lt; ft.force.y() &lt;&lt; std::setw(15)</span>
<span style="color: #5B6268;">      &lt;&lt; ft.force.z() &lt;&lt; std::endl;</span>
<span style="color: #5B6268;">    */</span>
  }

  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">mess with the FT sensor</span>
  zero.send();
  offset.send( ft );

  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">Interpolate the next trajectory point</span>
  <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">result</span> = rml-&gt;RMLPosition( *ip, op, flags );

  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">Update the current state to be the state</span>
  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">This assume that the positions/velocities/accelerations</span>
  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">are sent to the real robot _and_ that the real robot</span>
  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">will move to that position. Otherwise, the current state</span>
  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">should be obtained from the real roboto</span>
  *ip-&gt;CurrentPositionVector = *op-&gt;NewPositionVector;
  *ip-&gt;CurrentVelocityVector = *op-&gt;NewVelocityVector;
  *ip-&gt;CurrentAccelerationVector = *op-&gt;NewAccelerationVector;

  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">Pack the position into KDL and write to port</span>
  <span style="color: #a9a1e1;">KDL</span>::<span style="color: #ECBE7B;">JntArray</span> <span style="color: #dcaeea;">q</span>(chain.getNrOfJoints()), <span style="color: #dcaeea;">qd</span>(chain.getNrOfJoints());
  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">[[http://docs.ros.org/en/indigo/api/orocos_kdl/html/classKDL_1_1JntArray.html][jntarray api]]</span>
  op-&gt;GetNewPositionVector( q.data.data(), <span style="color: #51afef;">sizeof</span>(<span style="color: #ECBE7B;">double</span>)*chain.getNrOfJoints() );
  op-&gt;GetNewVelocityVector( qd.data.data(), <span style="color: #51afef;">sizeof</span>(<span style="color: #ECBE7B;">double</span>)*chain.getNrOfJoints() );

  <span style="color: #51afef;">if</span> (result ==<span style="color: #da8548; font-weight: bold;">0</span>){
    <span style="color: #51afef;">for</span> (<span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">i</span>=<span style="color: #da8548; font-weight: bold;">0</span>;i&lt;N;i++){
      <span style="color: #a9a1e1;">std</span>::cout&lt;&lt;<span style="color: #a9a1e1;">std</span>::setw(<span style="color: #da8548; font-weight: bold;">15</span>)&lt;&lt;q(i)&lt;&lt;<span style="color: #a9a1e1;">std</span>::setw(<span style="color: #da8548; font-weight: bold;">15</span>)&lt;&lt;qd(i);
    }
    <span style="color: #a9a1e1;">std</span>::endl;
  }
  port_msr_joints.write(q);

  <span style="color: #51afef;">if</span>( fk_solver != <span style="color: #a9a1e1;">NULL</span> ){

    <span style="color: #a9a1e1;">KDL</span>::<span style="color: #ECBE7B;">Frame</span> <span style="color: #dcaeea;">Rt</span>;
    <span style="color: #5B6268;">//</span><span style="color: #5B6268;">[[http://docs.ros.org/en/indigo/api/orocos_kdl/html/classKDL_1_1ChainFkSolverPos.html][KDL::JntToCart]]</span>
    <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">result</span> = fk_solver-&gt;JntToCart(q, Rt);
    <span style="color: #51afef;">if</span>( result &lt; <span style="color: #da8548; font-weight: bold;">0</span> ){
      <span style="color: #a9a1e1;">RTT</span>::log(<span style="color: #a9a1e1;">RTT</span>::Error) &lt;&lt; <span style="color: #98be65;">"Failed to compute FK"</span> &lt;&lt; <span style="color: #a9a1e1;">RTT</span>::endlog();
    }
    <span style="color: #51afef;">else</span>{
      <span style="color: #a9a1e1;">geometry_msgs</span>::<span style="color: #a9a1e1;">msg</span>::<span style="color: #ECBE7B;">PoseStamped</span> <span style="color: #dcaeea;">pose</span>;
      pose.header.frame_id = <span style="color: #98be65;">"world"</span>;
      pose.pose = <span style="color: #a9a1e1;">tf2</span>::toMsg( Rt );
      port_msr_pose.write(pose);
    }
  }

}

<span style="color: #ECBE7B;">void</span> <span style="color: #a9a1e1;">rtt_robot</span>::<span style="color: #c678dd;">stopHook</span>(){
  <span style="color: #a9a1e1;">std</span>::cout &lt;&lt; <span style="color: #98be65;">"rtt_robot::stopHook"</span> &lt;&lt; <span style="color: #a9a1e1;">std</span>::endl;
}

<span style="color: #ECBE7B;">void</span> <span style="color: #a9a1e1;">rtt_robot</span>::<span style="color: #c678dd;">cleanupHook</span>(){
  <span style="color: #a9a1e1;">std</span>::cout &lt;&lt; <span style="color: #98be65;">"rtt_robot::cleanupHook"</span> &lt;&lt; <span style="color: #a9a1e1;">std</span>::endl;
}

ORO_CREATE_COMPONENT(rtt_robot)

</pre>
</div>
</div>
</div>
