rsp_week09.org
** update =rtt_robot.ops=
#+begin_src shell
import("rtt_ros2")
import("rtt_ros2_node")
import("rtt_ros2_topics")
import("rtt_ros2_params")
import("rtt_ros2_geometry_msgs")

import("kdl_typekit")
import("rsp_week07")
# ros -> get from RTT::internal::GlobalService::Instance()->getService("ros");
# global_ros->getOperation("create_named_node");
ros.create_named_node("rtt")

loadComponent( "robot", "rtt_robot" )
setActivity( "robot", 0.01, 0, ORO_SCHED_OTHER )

loadComponent( "sensor", "rtt_sensor" )
setActivity( "sensor", 0.01, 0, ORO_SCHED_OTHER )

var ConnPolicy cp
connect( "robot.MsrWrench",  "sensor.MsrWrench",  cp )

stream("sensor.ft", ros.topic("/sensor/wrench", false))
stream("robot.MsrCartPose", ros.topic("/robot/frame", false))

sensor.configure()
sensor.start()

connectPeers("robot", "sensor")
robot.configure()
robot.start()
#+end_src


** Reflexxes api
#+begin_src shell
usr/local/include/Reflexxes.h

#+end_src
** Create an Ros node
RTT GlobalService can call the service of */ros/*, and have an internal operation called =create_named_node= which create an node and publish out.
#+begin_src c++
global_ros = RTT::internal::GlobalService::Instance()->getService("ros");
RTT::OperationCaller<bool(const std::string&)> create_node =
global_ros->getOperation("create_named_node");
create_node.ready();
create_node(name);
#+end_src
#+begin_src shell
ros.create_named_node("rtt")
#+end_src
if we check the =ros2 node list=, we will find node =/rtt=.
to check it's info
#+begin_src shell
~$ ros2 node info /rtt
/rtt
  Subscribers:
    /parameter_events: rcl_interfaces/msg/ParameterEvent
  Publishers:
    /parameter_events: rcl_interfaces/msg/ParameterEvent
    */robot/frame: geometry_msgs/msg/PoseStamped*
    /rosout: rcl_interfaces/msg/Log
   */sensor/wrench: geometry_msgs/msg/Wrench*
  Service Servers:
    /rtt/describe_parameters: rcl_interfaces/srv/DescribeParameters
    /rtt/get_parameter_types: rcl_interfaces/srv/GetParameterTypes
    /rtt/get_parameters: rcl_interfaces/srv/GetParameters
    /rtt/list_parameters: rcl_interfaces/srv/ListParameters
    /rtt/set_parameters: rcl_interfaces/srv/SetParameters
    /rtt/set_parameters_atomically: rcl_interfaces/srv/SetParametersAtomically
  Service Clients:

  Action Servers:

  Action Clients:

#+end_src
in ops to publish those two topic
#+begin_src shell
stream("sensor.ft", ros.topic("/sensor/wrench", false))
stream("robot.MsrCartPose", ros.topic("/robot/frame", false))
#+end_src
** Create an ROS Param
#+begin_src c++

global_params = global_ros->getService("rosparam");
getparam_operation = global_params->getOperation("getParameter");

rtt_ros2_node::getNode(this)->declare_parameter("robot_description",
                                            std::string("asdf"));

#+end_src
if we run the =ros2 param list=, it will show up the ="robot_description"=.
#+begin_src shell
ros2 param get /rtt robot_description
String value is: asdf

#+end_src
** Plugin the urdf into Orocos
To connect the ="robot_description"= with the robot.urdf, we need do following steps:
#+begin_src shell
cd src/lecture/rsp_week05/urdf/
xacro rsp.urdf.xacro >robot.urdf
ros2 run robot_state_publisher robot_state_publisher --ros-args --param robot_description:="`cat robot.urdf`"
#+end_src
navigate to urdf pwd, and set the param:
#+begin_src shell
ros2 param set /rtt robot_description "`cat robot.urdf`"
#+end_src
To check the configuration:
#+begin_src shell
robot.configure()
/*
Peer 0 sensor
Link left_base_link had 1 children
Link left_upper_link had 1 children
Link left_tool had 0 children
4334.556 [ Info   ][Logger] Description parsed to a tree
4334.556 [ Info   ][Logger] Description parsed to a chain
 = true
*/
#+end_src
