rsp_week09.html

<div id="outline-container-org3d3545d" class="outline-3">
<h3 id="org3d3545d"><span class="section-number-3">1.3.</span> update <code>rtt_robot.ops</code></h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #c678dd;">import</span><span style="color: #51afef;">(</span><span style="color: #98be65;">"rtt_ros2"</span><span style="color: #51afef;">)</span>
<span style="color: #c678dd;">import</span><span style="color: #51afef;">(</span><span style="color: #98be65;">"rtt_ros2_node"</span><span style="color: #51afef;">)</span>
<span style="color: #c678dd;">import</span><span style="color: #51afef;">(</span><span style="color: #98be65;">"rtt_ros2_topics"</span><span style="color: #51afef;">)</span>
<span style="color: #c678dd;">import</span><span style="color: #51afef;">(</span><span style="color: #98be65;">"rtt_ros2_params"</span><span style="color: #51afef;">)</span>
<span style="color: #c678dd;">import</span><span style="color: #51afef;">(</span><span style="color: #98be65;">"rtt_ros2_geometry_msgs"</span><span style="color: #51afef;">)</span>

<span style="color: #c678dd;">import</span><span style="color: #51afef;">(</span><span style="color: #98be65;">"kdl_typekit"</span><span style="color: #51afef;">)</span>
<span style="color: #c678dd;">import</span><span style="color: #51afef;">(</span><span style="color: #98be65;">"rsp_week07"</span><span style="color: #51afef;">)</span>
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">ros -&gt; get from RTT::internal::GlobalService::Instance()-&gt;getService("ros");</span>
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">global_ros-&gt;getOperation("create_named_node");</span>
<span style="color: #c678dd;">ros.create_named_node</span><span style="color: #51afef;">(</span><span style="color: #98be65;">"rtt"</span><span style="color: #51afef;">)</span>

<span style="color: #c678dd;">loadComponent</span><span style="color: #51afef;">(</span> <span style="color: #98be65;">"robot"</span>, <span style="color: #98be65;">"rtt_robot"</span> <span style="color: #51afef;">)</span>
<span style="color: #c678dd;">setActivity</span><span style="color: #51afef;">(</span> <span style="color: #98be65;">"robot"</span>, 0.01, 0, ORO_SCHED_OTHER <span style="color: #51afef;">)</span>

<span style="color: #c678dd;">loadComponent</span><span style="color: #51afef;">(</span> <span style="color: #98be65;">"sensor"</span>, <span style="color: #98be65;">"rtt_sensor"</span> <span style="color: #51afef;">)</span>
<span style="color: #c678dd;">setActivity</span><span style="color: #51afef;">(</span> <span style="color: #98be65;">"sensor"</span>, 0.01, 0, ORO_SCHED_OTHER <span style="color: #51afef;">)</span>

var ConnPolicy <span style="color: #ECBE7B;">cp</span>
<span style="color: #c678dd;">connect</span><span style="color: #51afef;">(</span> <span style="color: #98be65;">"robot.MsrWrench"</span>,  <span style="color: #98be65;">"sensor.MsrWrench"</span>,  <span style="color: #ECBE7B;">cp</span> <span style="color: #51afef;">)</span>

<span style="color: #c678dd;">stream</span><span style="color: #51afef;">(</span><span style="color: #98be65;">"sensor.ft"</span>, ros.topic<span style="color: #c678dd;">(</span><span style="color: #98be65;">"/sensor/wrench"</span>, false<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
<span style="color: #c678dd;">stream</span><span style="color: #51afef;">(</span><span style="color: #98be65;">"robot.MsrCartPose"</span>, ros.topic<span style="color: #c678dd;">(</span><span style="color: #98be65;">"/robot/frame"</span>, false<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>

<span style="color: #c678dd;">sensor.configure</span><span style="color: #51afef;">()</span>
<span style="color: #c678dd;">sensor.start</span><span style="color: #51afef;">()</span>

<span style="color: #c678dd;">connectPeers</span><span style="color: #51afef;">(</span><span style="color: #98be65;">"robot"</span>, <span style="color: #98be65;">"sensor"</span><span style="color: #51afef;">)</span>
<span style="color: #c678dd;">robot.configure</span><span style="color: #51afef;">()</span>
<span style="color: #c678dd;">robot.start</span><span style="color: #51afef;">()</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-orge639f73" class="outline-3">
<h3 id="orge639f73"><span class="section-number-3">1.4.</span> Reflexxes api</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">
<pre class="src src-shell">usr/local/include/Reflexxes.h

</pre>
</div>
</div>
</div>
<div id="outline-container-orgf0f6df7" class="outline-3">
<h3 id="orgf0f6df7"><span class="section-number-3">1.5.</span> Create an Ros node</h3>
<div class="outline-text-3" id="text-1-5">
<p>
RTT GlobalService can call the service of <b><i>ros</i></b>, and have an internal operation called <code>create_named_node</code> which create an node and publish out.
</p>
<div class="org-src-container">
<pre class="src src-c++">global_ros = <span style="color: #a9a1e1;">RTT</span>::<span style="color: #a9a1e1;">internal</span>::<span style="color: #a9a1e1;">GlobalService</span>::Instance()-&gt;getService(<span style="color: #98be65;">"ros"</span>);
<span style="color: #a9a1e1;">RTT</span>::<span style="color: #ECBE7B;">OperationCaller</span>&lt;<span style="color: #ECBE7B;">bool</span>(<span style="color: #51afef;">const</span> <span style="color: #a9a1e1;">std</span>::<span style="color: #ECBE7B;">string</span>&amp;)&gt; <span style="color: #dcaeea;">create_node</span> =
global_ros-&gt;getOperation(<span style="color: #98be65;">"create_named_node"</span>);
create_node.ready();
create_node(name);
</pre>
</div>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #c678dd;">ros.create_named_node</span><span style="color: #51afef;">(</span><span style="color: #98be65;">"rtt"</span><span style="color: #51afef;">)</span>
</pre>
</div>
<p>
if we check the <code>ros2 node list</code>, we will find node <code>/rtt</code>.
to check it&rsquo;s info
</p>
<div class="org-src-container">
<pre class="src src-shell">~$ ros2 node info /rtt
/rtt
  Subscribers:
    /parameter_events: rcl_interfaces/msg/ParameterEvent
  Publishers:
    /parameter_events: rcl_interfaces/msg/ParameterEvent
    */robot/frame: geometry_msgs/msg/PoseStamped*
    /rosout: rcl_interfaces/msg/Log
   */sensor/wrench: geometry_msgs/msg/Wrench*
  Service Servers:
    /rtt/describe_parameters: rcl_interfaces/srv/DescribeParameters
    /rtt/get_parameter_types: rcl_interfaces/srv/GetParameterTypes
    /rtt/get_parameters: rcl_interfaces/srv/GetParameters
    /rtt/list_parameters: rcl_interfaces/srv/ListParameters
    /rtt/set_parameters: rcl_interfaces/srv/SetParameters
    /rtt/set_parameters_atomically: rcl_interfaces/srv/SetParametersAtomically
  Service Clients:

  Action Servers:

  Action Clients:

</pre>
</div>
<p>
in ops to publish those two topic
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #c678dd;">stream</span><span style="color: #51afef;">(</span><span style="color: #98be65;">"sensor.ft"</span>, ros.topic<span style="color: #c678dd;">(</span><span style="color: #98be65;">"/sensor/wrench"</span>, false<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
<span style="color: #c678dd;">stream</span><span style="color: #51afef;">(</span><span style="color: #98be65;">"robot.MsrCartPose"</span>, ros.topic<span style="color: #c678dd;">(</span><span style="color: #98be65;">"/robot/frame"</span>, false<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org24fc4a6" class="outline-3">
<h3 id="org24fc4a6"><span class="section-number-3">1.6.</span> Create an ROS Param</h3>
<div class="outline-text-3" id="text-1-6">
<div class="org-src-container">
<pre class="src src-c++">
global_params = global_ros-&gt;getService(<span style="color: #98be65;">"rosparam"</span>);
getparam_operation = global_params-&gt;getOperation(<span style="color: #98be65;">"getParameter"</span>);

<span style="color: #a9a1e1;">rtt_ros2_node</span>::getNode(<span style="color: #51afef;">this</span>)-&gt;declare_parameter(<span style="color: #98be65;">"robot_description"</span>,
                                            <span style="color: #a9a1e1;">std</span>::string(<span style="color: #98be65;">"asdf"</span>));

</pre>
</div>
<p>
if we run the <code>ros2 param list</code>, it will show up the <code>"robot_description"</code>.
</p>
<div class="org-src-container">
<pre class="src src-shell">ros2 param get /rtt robot_description
String value is: asdf

</pre>
</div>
</div>
</div>
<div id="outline-container-orga624cb9" class="outline-3">
<h3 id="orga624cb9"><span class="section-number-3">1.7.</span> Plugin the urdf into Orocos</h3>
<div class="outline-text-3" id="text-1-7">
<p>
To connect the <code>"robot_description"</code> with the robot.urdf, we need do following steps:
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #ECBE7B;">cd</span> src/lecture/rsp_week05/urdf/
xacro rsp.urdf.xacro &gt;robot.urdf
ros2 run robot_state_publisher robot_state_publisher --ros-args --param robot_description:=<span style="color: #98be65;">"</span><span style="color: #51afef; font-weight: bold;">`</span><span style="color: #51afef; font-weight: bold;">cat</span><span style="color: #51afef; font-weight: bold;"> robot.urdf`</span><span style="color: #98be65;">"</span>
</pre>
</div>
<p>
navigate to urdf pwd, and set the param:
</p>
<div class="org-src-container">
<pre class="src src-shell">ros2 param set /rtt robot_description <span style="color: #98be65;">"</span><span style="color: #51afef; font-weight: bold;">`</span><span style="color: #51afef; font-weight: bold;">cat</span><span style="color: #51afef; font-weight: bold;"> robot.urdf`</span><span style="color: #98be65;">"</span>
</pre>
</div>
<p>
To check the configuration:
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #c678dd;">robot.configure</span><span style="color: #51afef;">()</span>
/*
Peer <span style="color: #da8548; font-weight: bold;">0</span> sensor
Link left_base_link had <span style="color: #da8548; font-weight: bold;">1</span> children
Link left_upper_link had <span style="color: #da8548; font-weight: bold;">1</span> children
Link left_tool had <span style="color: #da8548; font-weight: bold;">0</span> children
<span style="color: #da8548; font-weight: bold;">4334.556</span> <span style="color: #51afef;">[</span> Info   <span style="color: #51afef;">][</span>Logger<span style="color: #51afef;">]</span> Description parsed to a tree
<span style="color: #da8548; font-weight: bold;">4334.556</span> <span style="color: #51afef;">[</span> Info   <span style="color: #51afef;">][</span>Logger<span style="color: #51afef;">]</span> Description parsed to a chain
 = true
*/
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Huan Min</p>
<p class="date">Created: 2023-04-09 Sun 19:20</p>
</div>
</body>
</html>